ankuns/nrfx/bsp/stable/mdk/nrf7140_ppr_peripherals.h
#define P6_CTRLSEL_MAP1 0                            /*!< (unspecified)                                                        */
#define P6_CTRLSEL_MAP2 0                            /*!< (unspecified)                                                        */
#define P6_CTRLSEL_MAP3 1                            /*!< (unspecified)                                                        */
#define P6_PIN_NUM_MIN 0                             /*!< (unspecified)                                                        */
#define P6_PIN_NUM_MAX 13                            /*!< (unspecified)                                                        */
#define P6_PIN_NUM_SIZE 14                           /*!< (unspecified)                                                        */
#define P6_FEATURE_PINS_PRESENT 0x00003FFFUL         /*!< (unspecified)                                                        */
#define P6_DRIVECTRL 1                               /*!< (unspecified)                                                        */
#define P6_RETAIN 1                                  /*!< (unspecified)                                                        */
#define P6_PWRCTRL 0                                 /*!< (unspecified)                                                        */
#define P6_PWRCTRL_SEPARATE_REG 1                    /*!< (unspecified)                                                        */
#define P6_VSS_FLOAT_DFT 0                           /*!< (unspecified)                                                        */
#define P6_PIN_OWNER_SEC 0                           /*!< (unspecified)                                                        */
#define P6_WIFI_CORE_PRESENT 1                       /*!< (unspecified)                                                        */
#define P6_RETAIN_PER_PIN 1                          /*!< (unspecified)                                                        */
#define P6_CLOCKPIN 1                                /*!< (unspecified)                                                        */
#define P6_BIASCTRL 0                                /*!< (unspecified)                                                        */

#define P8_CTRLSEL_MAP1 0                            /*!< (unspecified)                                                        */
#define P8_CTRLSEL_MAP2 0                            /*!< (unspecified)                                                        */
#define P8_CTRLSEL_MAP3 1                            /*!< (unspecified)                                                        */
#define P8_PIN_NUM_MIN 0                             /*!< (unspecified)                                                        */
#define P8_PIN_NUM_MAX 4                             /*!< (unspecified)                                                        */
#define P8_PIN_NUM_SIZE 5                            /*!< (unspecified)                                                        */
#define P8_FEATURE_PINS_PRESENT 0x0000001FUL         /*!< (unspecified)                                                        */
#define P8_DRIVECTRL 1                               /*!< (unspecified)                                                        */
#define P8_RETAIN 1                                  /*!< (unspecified)                                                        */
#define P8_PWRCTRL 0                                 /*!< (unspecified)                                                        */
#define P8_PWRCTRL_SEPARATE_REG 1                    /*!< (unspecified)                                                        */
#define P8_VSS_FLOAT_DFT 0                           /*!< (unspecified)                                                        */
#define P8_PIN_OWNER_SEC 0                           /*!< (unspecified)                                                        */
#define P8_WIFI_CORE_PRESENT 1                       /*!< (unspecified)                                                        */
#define P8_RETAIN_PER_PIN 1                          /*!< (unspecified)                                                        */
#define P8_CLOCKPIN 1                                /*!< (unspecified)                                                        */
#define P8_BIASCTRL 0                                /*!< (unspecified)                                                        */

#define P9_CTRLSEL_MAP1 0                            /*!< (unspecified)                                                        */
#define P9_CTRLSEL_MAP2 0                            /*!< (unspecified)                                                        */
#define P9_CTRLSEL_MAP3 1                            /*!< (unspecified)                                                        */
#define P9_PIN_NUM_MIN 0                             /*!< (unspecified)                                                        */
#define P9_PIN_NUM_MAX 5                             /*!< (unspecified)                                                        */
#define P9_PIN_NUM_SIZE 6                            /*!< (unspecified)                                                        */
#define P9_FEATURE_PINS_PRESENT 0x0000003FUL         /*!< (unspecified)                                                        */
#define P9_DRIVECTRL 0                               /*!< (unspecified)                                                        */
#define P9_RETAIN 1                                  /*!< (unspecified)                                                        */
#define P9_PWRCTRL 1                                 /*!< (unspecified)                                                        */
#define P9_PWRCTRL_SEPARATE_REG 1                    /*!< (unspecified)                                                        */
#define P9_VSS_FLOAT_DFT 1                           /*!< (unspecified)                                                        */
#define P9_PIN_OWNER_SEC 0                           /*!< (unspecified)                                                        */
#define P9_WIFI_CORE_PRESENT 1                       /*!< (unspecified)                                                        */
#define P9_RETAIN_PER_PIN 1                          /*!< (unspecified)                                                        */
#define P9_CLOCKPIN 1                                /*!< (unspecified)                                                        */
#define P9_BIASCTRL 0                                /*!< (unspecified)                                                        */

/*GPIO Internal*/
#define GPIOINTERNAL_PRESENT 1
#define GPIOINTERNAL_COUNT 1

